# RbsCurvetypeDefaultBendParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurvetypeDefaultBendParam Property
ParameterTypeId Class See Also
---
"Bend"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypeDefaultBendParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypeDefaultBendParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypeDefaultBendParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace